# Pandas十分钟入门教程

这是一个简短的、针对新手的pandas使用教程。你可以在pandas使用手册（Cookbook）中查阅更复杂的用法。通常，我们以如下约定导入pandas库：

In [1]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

## 创建对象

通过列表创建一个序列对象（Series），Pandas会自动创建一个默认的数字索引。

In [2]:
a = pd.Series([1,3,5,np.nan, 6,8])

a

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

通过Numpy数组创建一个数据框对象（DataFrame）， 并带有日期索引和列标签。

In [3]:
dates = pd.date_range('20130101', periods=6)

print(dates)

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

df

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2013-01-01  0.506362 -0.239510 -0.999606  0.605183
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849
2013-01-03  2.813728 -0.574829  0.702012 -1.167654
2013-01-04  0.686018  1.008508 -1.951556  1.453250
2013-01-05 -1.351634  0.121923  1.575604  0.623614
2013-01-06 -0.021771  0.620364 -0.065262 -0.065593

通过字典创建数据框对象（DataFrame），字典的每个元素会被转换为一个类似序列的对象（series-like）。

In [4]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo'
})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

获取数据框各列的数据类型

In [5]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

如果你使用IPython（或Jupyter Notebook），Tab键可自动补全列名（就像补全对象的公有属性一样）。如下是部分可补全的属性：

In [6]:
# df2.<TAB>

# df2.A df2.bool
# df2.abs df2.boxplot
# df2.add df2.C
# df2.add_prefix df2.clip
# df2.add_suffix df2.clip_lower
# df2.align df2.clip_upper
# df2.all df2.columns
# df2.any df2.combine
# df2.append df2.combine_first
# df2.apply df2.compound
# df2.applymap df2.consolidate
# df2.D

如你所见，列名A，B，C和D可自动补全。列名E也可自动补全；为了简洁，此处剩余的属性被删减了。

## 显示数据

查看数据框顶部和底部的记录（行）

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.506362 -0.239510 -0.999606  0.605183
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849
2013-01-03  2.813728 -0.574829  0.702012 -1.167654
2013-01-04  0.686018  1.008508 -1.951556  1.453250
2013-01-05 -1.351634  0.121923  1.575604  0.623614

In [8]:
df.tail()

                   A         B         C         D
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849
2013-01-03  2.813728 -0.574829  0.702012 -1.167654
2013-01-04  0.686018  1.008508 -1.951556  1.453250
2013-01-05 -1.351634  0.121923  1.575604  0.623614
2013-01-06 -0.021771  0.620364 -0.065262 -0.065593

显示索引、列名，以及其中的numpy数据

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[ 0.50636204, -0.23951042, -0.99960579,  0.60518307],
       [-0.55975477,  0.18081385, -1.27448044, -0.3358493 ],
       [ 2.81372812, -0.5748287 ,  0.70201173, -1.16765446],
       [ 0.68601847,  1.00850788, -1.95155555,  1.4532499 ],
       [-1.35163382,  0.12192256,  1.57560361,  0.62361422],
       [-0.02177126,  0.62036438, -0.0652622 , -0.06559272]])

describe方法查看数据的描述性统计信息

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.345491  0.186212 -0.335548  0.185492
std    1.419057  0.570832  1.321827  0.910071
min   -1.351634 -0.574829 -1.951556 -1.167654
25%   -0.425259 -0.149152 -1.205762 -0.268285
50%    0.242295  0.151368 -0.532434  0.269795
75%    0.641104  0.510477  0.510193  0.619006
max    2.813728  1.008508  1.575604  1.453250

转置数据

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.506362   -0.559755    2.813728    0.686018   -1.351634   -0.021771
B   -0.239510    0.180814   -0.574829    1.008508    0.121923    0.620364
C   -0.999606   -1.274480    0.702012   -1.951556    1.575604   -0.065262
D    0.605183   -0.335849   -1.167654    1.453250    0.623614   -0.065593

按轴排序数据

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.605183 -0.999606 -0.239510  0.506362
2013-01-02 -0.335849 -1.274480  0.180814 -0.559755
2013-01-03 -1.167654  0.702012 -0.574829  2.813728
2013-01-04  1.453250 -1.951556  1.008508  0.686018
2013-01-05  0.623614  1.575604  0.121923 -1.351634
2013-01-06 -0.065593 -0.065262  0.620364 -0.021771

按值排序数据

In [15]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03  2.813728 -0.574829  0.702012 -1.167654
2013-01-01  0.506362 -0.239510 -0.999606  0.605183
2013-01-05 -1.351634  0.121923  1.575604  0.623614
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849
2013-01-06 -0.021771  0.620364 -0.065262 -0.065593
2013-01-04  0.686018  1.008508 -1.951556  1.453250

## 选择

注意：尽管标准的Python和Numpy表达式在数据选择和设置上较为直观，并且在交互式环境能派上用场，但对于开发代码，我们推荐使用经过优化的pandas获取数据的方法，如.at, .iat, .loc, .iloc和ix

### 获取数据

选择一个单独列，将会返回一个序列对象（Series）， 等价于df.A

In [16]:
df['A']

2013-01-01    0.506362
2013-01-02   -0.559755
2013-01-03    2.813728
2013-01-04    0.686018
2013-01-05   -1.351634
2013-01-06   -0.021771
Freq: D, Name: A, dtype: float64

使用[]操作符可对数据框的行进行切片操作

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01  0.506362 -0.239510 -0.999606  0.605183
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849
2013-01-03  2.813728 -0.574829  0.702012 -1.167654

In [18]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849
2013-01-03  2.813728 -0.574829  0.702012 -1.167654
2013-01-04  0.686018  1.008508 -1.951556  1.453250

### 通过标签选择数据

通过标签获取一个记录（行数据）

In [19]:
df.loc[dates[0]]

A    0.506362
B   -0.239510
C   -0.999606
D    0.605183
Name: 2013-01-01 00:00:00, dtype: float64

在多个轴上通过标签选择数据

In [20]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.506362 -0.239510
2013-01-02 -0.559755  0.180814
2013-01-03  2.813728 -0.574829
2013-01-04  0.686018  1.008508
2013-01-05 -1.351634  0.121923
2013-01-06 -0.021771  0.620364

使用标签进行切片， 两个端点都包含在内

In [21]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.559755  0.180814
2013-01-03  2.813728 -0.574829
2013-01-04  0.686018  1.008508

数据降维（返回降维的数据）

In [22]:
df.loc['20130102', ['A', 'B']]

A   -0.559755
B    0.180814
Name: 2013-01-02 00:00:00, dtype: float64

获取一个标量数据

In [23]:
# 通过行标签和列表标签获取一个标量数据
df.loc[dates[0], 'A']

0.5063620415098351

更快地获取标量数量

In [24]:
df.at[dates[0], 'A']

0.5063620415098351

### 通过位置选择数据

通过传入数字位置选择数据

In [25]:
df.iloc[3]

A    0.686018
B    1.008508
C   -1.951556
D    1.453250
Name: 2013-01-04 00:00:00, dtype: float64

使用数字切片，类似Python和Numpy中的切片

In [26]:
# 注意此处的切片不包含结束位置
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.686018  1.008508
2013-01-05 -1.351634  0.121923

使用数字列表，类似Python和Numpy的风格

In [27]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02 -0.559755 -1.274480
2013-01-03  2.813728  0.702012
2013-01-05 -1.351634  1.575604

只选择行数据

In [28]:
# : 表示选择所有列
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849
2013-01-03  2.813728 -0.574829  0.702012 -1.167654

只选择列数据

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.239510 -0.999606
2013-01-02  0.180814 -1.274480
2013-01-03 -0.574829  0.702012
2013-01-04  1.008508 -1.951556
2013-01-05  0.121923  1.575604
2013-01-06  0.620364 -0.065262

获取一个具体的值

In [30]:
df.iloc[1, 1]

0.18081384881128737

快速获取一个标量数据

In [31]:
df.iat[1, 1]

0.18081384881128737

### 布尔索引

使用单独列的值选择数据

In [32]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.506362 -0.239510 -0.999606  0.605183
2013-01-03  2.813728 -0.574829  0.702012 -1.167654
2013-01-04  0.686018  1.008508 -1.951556  1.453250

选择满足布尔条件的值

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.506362       NaN       NaN  0.605183
2013-01-02       NaN  0.180814       NaN       NaN
2013-01-03  2.813728       NaN  0.702012       NaN
2013-01-04  0.686018  1.008508       NaN  1.453250
2013-01-05       NaN  0.121923  1.575604  0.623614
2013-01-06       NaN  0.620364       NaN       NaN

使用isin()方法筛选

In [34]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

df2

                   A         B         C         D      E
2013-01-01  0.506362 -0.239510 -0.999606  0.605183    one
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849    one
2013-01-03  2.813728 -0.574829  0.702012 -1.167654    two
2013-01-04  0.686018  1.008508 -1.951556  1.453250  three
2013-01-05 -1.351634  0.121923  1.575604  0.623614   four
2013-01-06 -0.021771  0.620364 -0.065262 -0.065593  three

In [35]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  2.813728 -0.574829  0.702012 -1.167654   two
2013-01-05 -1.351634  0.121923  1.575604  0.623614  four

### 修改数据

增加一个新列会自动通过索引对齐数据

In [36]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df['E'] = s1

df

                   A         B         C         D    E
2013-01-01  0.506362 -0.239510 -0.999606  0.605183  NaN
2013-01-02 -0.559755  0.180814 -1.274480 -0.335849  1.0
2013-01-03  2.813728 -0.574829  0.702012 -1.167654  2.0
2013-01-04  0.686018  1.008508 -1.951556  1.453250  3.0
2013-01-05 -1.351634  0.121923  1.575604  0.623614  4.0
2013-01-06 -0.021771  0.620364 -0.065262 -0.065593  5.0

通过标签设置数据

In [38]:
df.at[dates[0], 'A'] = 0

通过位置设置数据

In [39]:
df.iat[0, 1] = 0

通过Numpy数组设置数据

In [40]:
df.loc[:, 'D'] = np.array([5] * len(df))

这步操作的结果为：

In [41]:
df

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.999606  5  NaN
2013-01-02 -0.559755  0.180814 -1.274480  5  1.0
2013-01-03  2.813728 -0.574829  0.702012  5  2.0
2013-01-04  0.686018  1.008508 -1.951556  5  3.0
2013-01-05 -1.351634  0.121923  1.575604  5  4.0
2013-01-06 -0.021771  0.620364 -0.065262  5  5.0

A where operation with setting

In [42]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.999606 -5  NaN
2013-01-02 -0.559755 -0.180814 -1.274480 -5 -1.0
2013-01-03 -2.813728 -0.574829 -0.702012 -5 -2.0
2013-01-04 -0.686018 -1.008508 -1.951556 -5 -3.0
2013-01-05 -1.351634 -0.121923 -1.575604 -5 -4.0
2013-01-06 -0.021771 -0.620364 -0.065262 -5 -5.0

### 处理缺失数据

Pandas使用np.nan表示缺失值。缺失值默认不会参与计算。

重新索引（Reindexing）可改变、新增或删除某个轴上的索引， 并返回一个数据副本。

In [43]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1], 'E'] = 1

df1

                   A         B         C  D    E    E
2013-01-01  0.000000  0.000000 -0.999606  5  1.0  1.0
2013-01-02 -0.559755  0.180814 -1.274480  5  1.0  1.0
2013-01-03  2.813728 -0.574829  0.702012  5  2.0  2.0
2013-01-04  0.686018  1.008508 -1.951556  5  3.0  3.0

删除所有含有缺失值的行

In [44]:
df1.dropna(how='any')

                   A         B         C  D    E    E
2013-01-01  0.000000  0.000000 -0.999606  5  1.0  1.0
2013-01-02 -0.559755  0.180814 -1.274480  5  1.0  1.0
2013-01-03  2.813728 -0.574829  0.702012  5  2.0  2.0
2013-01-04  0.686018  1.008508 -1.951556  5  3.0  3.0

填充缺失值

In [45]:
df1.fillna(value=5)

                   A         B         C  D    E    E
2013-01-01  0.000000  0.000000 -0.999606  5  1.0  1.0
2013-01-02 -0.559755  0.180814 -1.274480  5  1.0  1.0
2013-01-03  2.813728 -0.574829  0.702012  5  2.0  2.0
2013-01-04  0.686018  1.008508 -1.951556  5  3.0  3.0

获取缺失值处的布尔掩码

In [46]:
# 文档中使用的是isna()方法，最新文档为0.21.0
# 我使用的pandas版本为0.20.3
pd.isnull(df1)

                A      B      C      D      E      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

## 操作

### 统计操作

操作不包括缺失数据。

描述性统计，获取均值

In [47]:
# 默认在轴0上执行操作
df.mean()

A    0.261098
B    0.226130
C   -0.335548
D    5.000000
E    3.000000
dtype: float64

在另一轴上执行相同操作

In [48]:
df.mean(1)

2013-01-01    1.000099
2013-01-02    0.869316
2013-01-03    1.988182
2013-01-04    1.548594
2013-01-05    1.869178
2013-01-06    2.106666
Freq: D, dtype: float64

操作具有不同维度和需要对齐的数据对象，Pandas会自动沿指定维度进行广播。

In [49]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [50]:
df.sub(s, axis='index')

                   A         B         C    D    E
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  1.813728 -1.574829 -0.297988  4.0  1.0
2013-01-04 -2.313982 -1.991492 -4.951556  2.0  0.0
2013-01-05 -6.351634 -4.878077 -3.424396  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### 批处理Apply

使用apple()方法向数据应用方法

In [51]:
df.apply(np.cumsum)

                   A         B         C   D     E
2013-01-01  0.000000  0.000000 -0.999606   5   NaN
2013-01-02 -0.559755  0.180814 -2.274086  10   1.0
2013-01-03  2.253973 -0.394015 -1.572074  15   3.0
2013-01-04  2.939992  0.614493 -3.523630  20   6.0
2013-01-05  1.588358  0.736416 -1.948026  25  10.0
2013-01-06  1.566587  1.356780 -2.013289  30  15.0

In [52]:
df.apply(lambda x: x.max() - x.min())

A    4.165362
B    1.583337
C    3.527159
D    0.000000
E    4.000000
dtype: float64

### 频率统计

In [53]:
s = pd.Series(np.random.randint(0, 7, size=10))

s

0    2
1    1
2    1
3    2
4    0
5    4
6    2
7    2
8    2
9    5
dtype: int32

In [54]:
s.value_counts()

2    5
1    2
5    1
4    1
0    1
dtype: int64

### 字符串方法

序列对象（Series）具备一套字符串处理方法，通过str属性可访问，该方法可作用在序列对象的每一个元素上，如下所示。注意：字符串中的模式匹配默认使用正则表达式。

In [55]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## 合并（Merge）

### 拼接（Concat）

Pandas提供多种方法用于序列对象（Series）和数据框（DataFrame）的连接，面板对象（Panel）则有多套用于连接与合并的索引与代数操作。

使用concat()函数拼接pandas对象

In [56]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.014991  0.615140  0.057307  2.750234
1  0.557095 -0.807464 -0.690610 -0.724167
2  0.084429 -1.213445  2.218611 -1.562457
3  0.038093  1.394232 -0.111589 -0.647436
4 -0.031822  1.746354 -3.388941  0.781220
5  1.449241  0.833616 -0.479380  0.085241
6 -0.941601 -0.661816  0.847317 -0.651710
7  0.276651  0.583338 -0.836248 -0.163109
8  0.346899 -0.998467  0.384197  0.065897
9  0.543079  0.803087 -0.704686  0.937744

In [57]:
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.014991  0.615140  0.057307  2.750234
1  0.557095 -0.807464 -0.690610 -0.724167
2  0.084429 -1.213445  2.218611 -1.562457
3  0.038093  1.394232 -0.111589 -0.647436
4 -0.031822  1.746354 -3.388941  0.781220
5  1.449241  0.833616 -0.479380  0.085241
6 -0.941601 -0.661816  0.847317 -0.651710
7  0.276651  0.583338 -0.836248 -0.163109
8  0.346899 -0.998467  0.384197  0.065897
9  0.543079  0.803087 -0.704686  0.937744

### 连接（Join）

SQL风格的合并

In [58]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [59]:
right

   key  rval
0  foo     4
1  foo     5

In [60]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

另一个列子，如下所示：

In [64]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [65]:
right

   key  rval
0  foo     4
1  bar     5

In [66]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### 追加（Append）

向一个DataFrame对象追加行记录

In [67]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.390142 -1.033301 -0.799550  0.872866
1 -0.598960  0.001595 -0.743185  0.078239
2 -0.656341 -1.886403 -1.350258 -0.608329
3 -0.964319  0.561946  0.909172  0.777524
4 -0.125915  2.047289 -0.912489 -0.136769
5 -0.440170  0.898767 -0.545406  0.232784
6  1.488156  0.749224  0.255838 -1.173739
7  0.664328  0.145228  0.226625 -0.961424

In [69]:
a = df.iloc[3]
df.append(a, ignore_index=True)

          A         B         C         D
0 -0.390142 -1.033301 -0.799550  0.872866
1 -0.598960  0.001595 -0.743185  0.078239
2 -0.656341 -1.886403 -1.350258 -0.608329
3 -0.964319  0.561946  0.909172  0.777524
4 -0.125915  2.047289 -0.912489 -0.136769
5 -0.440170  0.898767 -0.545406  0.232784
6  1.488156  0.749224  0.255838 -1.173739
7  0.664328  0.145228  0.226625 -0.961424
8 -0.964319  0.561946  0.909172  0.777524

## 分组

分组（group by）一般涉及以下多个步骤：

* 拆分（splitting）：按照一定的标准将数据拆分为不同的分组
* 批处理（applying）：对各分组独立作用一个函数或方法
* 组合（combining）：将处理结果组合为一定的数据结构

In [71]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one -0.726813 -1.257841
1  bar    one -1.124421  0.001018
2  foo    two  2.084301 -0.099493
3  bar  three -0.992508  0.826064
4  foo    two  0.160144 -1.140255
5  bar    two  0.207692  0.033766
6  foo    one  1.266009 -0.866466
7  foo  three -0.598042  0.185629

分组，然后对各分组结果应用`sum()`函数

In [72]:
df.groupby('A').sum()

            C         D
A
bar -1.909238  0.860848
foo  2.185598 -3.178427

对多列进行分组形成层级索引，并对分组结果调用方法

In [73]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -1.124421  0.001018
    three -0.992508  0.826064
    two    0.207692  0.033766
foo one    0.539196 -2.124307
    three -0.598042  0.185629
    two    2.244445 -1.239748

## 重组（Reshaping）

### Stack

In [76]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.740979 -0.976490
      two     0.212885  0.063104
baz   one     0.293856  0.992414
      two    -1.213390  0.490943

`stack()`方法用于压缩DataFrame对象的第一个列层级为行索引

In [77]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.740979
               B   -0.976490
       two     A    0.212885
               B    0.063104
baz    one     A    0.293856
               B    0.992414
       two     A   -1.213390
               B    0.490943
dtype: float64

压缩后的数据框（DataFrame）或序列对象（Series）（拥有多级索引），`stack()`方法的相反操作是`unstack()`，默认解压最后一个级别的行索引

In [80]:
stacked.unstack()

                     A         B
first second
bar   one     0.740979 -0.976490
      two     0.212885  0.063104
baz   one     0.293856  0.992414
      two    -1.213390  0.490943

In [82]:
stacked.unstack(1)

second        one       two
first
bar   A  0.740979  0.212885
      B -0.976490  0.063104
baz   A  0.293856 -1.213390
      B  0.992414  0.490943

In [83]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.740979  0.293856
       B -0.976490  0.992414
two    A  0.212885 -1.213390
       B  0.063104  0.490943

### 透视表

In [84]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4, 
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar','bar'] * 2,
                   'D': np.random.randn(12), 
                   'E': np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.415586  1.500793
1     one  B  foo  0.004249  0.605891
2     two  C  foo -0.394697 -1.362877
3   three  A  bar  0.710854  0.019674
4     one  B  bar  0.543125 -1.073494
5     one  C  bar  1.033002 -0.612940
6     two  A  foo -0.947768  1.064961
7   three  B  foo -0.243712  1.634901
8     one  C  foo  1.123213  2.041329
9     one  A  bar  1.427872  1.241694
10    two  B  bar -1.586202  0.122550
11  three  C  bar -1.512898  0.832404

我们可通过以上的DataFrame对象创建一个数据透视表

In [85]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  1.427872 -0.415586
      B  0.543125  0.004249
      C  1.033002  1.123213
three A  0.710854       NaN
      B       NaN -0.243712
      C -1.512898       NaN
two   A       NaN -0.947768
      B -1.586202       NaN
      C       NaN -0.394697

## 时间序列

Pandas具有简单、强大和高效的

熊猫具有简单，强大和高效的功能，用于在变频期间执行重采样操作